# =============================================================================
# Homebrew Brewfile — macOS
# =============================================================================

# Taps
tap "oven-sh/bun"
tap "jesseduffield/lazygit"
tap "asmvik/formulae"

# =============================================================================
# Core CLI Tools
# =============================================================================

brew "git"
brew "git-delta"
brew "curl"
brew "wget"
brew "jq"

# =============================================================================
# Shell & Prompt
# =============================================================================

brew "zsh"
brew "zinit"
brew "starship"
brew "fastfetch"

# =============================================================================
# Modern CLI Tools (Rust-based replacements)
# =============================================================================

brew "fd"                          # find alternative
brew "fzf"                         # fuzzy finder
brew "ripgrep"                     # grep alternative
brew "bat"                         # cat alternative (syntax highlighting)
brew "bat-extras"                  # batgrep, batdiff, batman, etc.
brew "eza"                         # ls alternative (maintained fork of exa)
brew "zoxide"                      # cd alternative (smart directory jumper)
brew "dust"                        # du alternative (disk usage visualizer)
brew "procs"                       # ps alternative (modern process viewer)
brew "sd"                          # sed alternative (simpler regex replace)
brew "tealdeer"                    # tldr pages (concise man pages)
brew "tokei"                       # code statistics
brew "bottom"                      # top/htop alternative (system monitor)

# =============================================================================
# Node.js — FNM (Fast Node Manager, Rust-based)
# =============================================================================

brew "fnm"
brew "oven-sh/bun/bun"

# =============================================================================
# Languages & Toolchains
# =============================================================================

brew "python"
brew "go"
brew "rustup-init"
brew "openjdk@17"                  # Required by React Native / Android dev

# =============================================================================
# Editors
# =============================================================================

brew "neovim", args: ["HEAD"]

# =============================================================================
# DevOps & Containers
# =============================================================================

cask "docker-desktop"
brew "lazydocker"
brew "jesseduffield/lazygit/lazygit"

# =============================================================================
# Databases
# =============================================================================

brew "pgcli"
brew "postgresql"

# =============================================================================
# Terminal Multiplexer
# =============================================================================

brew "tmux"

# =============================================================================
# Window Management (macOS)
# =============================================================================

brew "asmvik/formulae/skhd"
brew "asmvik/formulae/yabai"

# =============================================================================
# System Utilities
# =============================================================================

brew "glib"
brew "pkg-config"
brew "mas"
brew "mackup"

# =============================================================================
# Cask Apps
# =============================================================================

cask "android-studio"
cask "1password"
cask "github"
cask "raycast"
cask "rocket"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zed"
cask "zen"
