# =============================================================================
# Homebrew Brewfile — macOS
# =============================================================================

# Taps
tap "oven-sh/bun"
tap "jesseduffield/lazygit"
tap "asmvik/formulae"

# =============================================================================
# Core CLI Tools
# =============================================================================

brew "git"
brew "git-delta"
brew "curl"
brew "wget"
brew "jq"

# =============================================================================
# Shell & Prompt
# =============================================================================

brew "zsh"
brew "zinit"
brew "starship"
brew "fastfetch"

# =============================================================================
# Search & Navigation
# =============================================================================

brew "fd"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "bat-extras"

# =============================================================================
# Node.js — FNM (Fast Node Manager, Rust-based)
# =============================================================================

brew "fnm"
brew "oven-sh/bun/bun"

# =============================================================================
# Languages & Toolchains
# =============================================================================

brew "python"
brew "go"
brew "rustup-init"

# =============================================================================
# Editors
# =============================================================================

brew "neovim", args: ["HEAD"]

# =============================================================================
# DevOps & Containers
# =============================================================================

brew "docker"
brew "lazydocker"
brew "jesseduffield/lazygit/lazygit"

# =============================================================================
# Databases
# =============================================================================

brew "pgcli"
brew "postgresql"

# =============================================================================
# Terminal Multiplexer
# =============================================================================

brew "tmux"

# =============================================================================
# Window Management (macOS)
# =============================================================================

brew "asmvik/formulae/skhd"
brew "asmvik/formulae/yabai"

# =============================================================================
# System Utilities
# =============================================================================

brew "glib"
brew "pkg-config"
brew "sf-symbols"
brew "mas"
brew "mackup"

# =============================================================================
# Cask Apps
# =============================================================================

cask "1password"
cask "docker"
cask "github"
cask "raycast"
cask "rocket"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zed"
cask "zen"
