tap "federico-terzi/espanso"
tap "mongodb/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "lucassabreu/tap"
tap "xorpse/formulae"
tap "xwmx/taps"
brew "python@3.9"
brew "python@3.8"
brew "bat"
brew "glib"
brew "pkg-config"
brew "dash"
brew "fd"
brew "fzf"
brew "gh"
brew "docker"
brew "git"
brew "git-delta"
brew "libusb"
brew "fish"
brew "fisher"
brew "zoxide"
#brew "gnupg"
brew "go"
#brew "hasura-cli"
#brew "hyperfine"
brew "jq"
brew "lazydocker"
brew "lf"
brew "lsd"
brew "luajit", args: ["HEAD"]
brew "mackup"
brew "mosh"
# brew "ncdu"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "exa"

brew "nvm"
brew "tmux"
brew "overmind"
brew "pgcli"
brew "postgresql"
brew "ripgrep"
brew "spotify-tui"
brew "starship"
brew "switchaudio-osx"
brew "tealdeer"
brew "terminal-notifier"
brew "wallpaper"
brew "wget"
brew "yarn"
brew "zlib"
brew "pipenv"
brew "zoxide"
brew "bottom"
brew "federico-terzi/espanso/espanso"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
# brew "stripe/stripe-cli/stripe"
brew "xorpse/formulae/yabai", args: ["HEAD"]
# cask "kitty"
cask "balenaetcher"
cask "discord"
# cask "evernote"
# cask "fantastical"
cask "figma"
# cask "ganache"
# cask "home-assistant"
# cask "hyper"
# cask "imageoptim"
# cask "inkscape"
# cask "ipfs"
cask "keycastr"
# cask "obs"
# cask "obsidian"
# cask "plover"
cask "postman"
# cask "qutebrowser"
cask "raycast"
cask "rocket"
#  cask "sequel-pro"
# cask "signal"
# cask "skitch"

cask "telegram"
cask "slack"
# cask "spacelauncher"
cask "spotify"
cask "visual-studio-code"
# cask "vivaldi"
cask "whatsapp"
cask "pycharm"
cask "iterm2"
# cask "microsoft-edge"
# cask "google-chrome"
cask "hammerspoon"
cask "fish"
cask "fisher"
cask "wget"
cask "curl"
cask "zoxide"

